app/controllers/member/campaigns/web_controller.rb

SELECT `web_campaigns`.* FROM `web_campaigns`  WHERE `web_campaigns`.`user_id` = 3
SELECT `websites`.* FROM `websites`  WHERE `websites`.`user_id` = 3
---
  def index
    @websites = current_user.websites

    @web_campaigns = WebCampaign.where(user_id: current_user.id)

SELECT  `web_campaigns`.* FROM `web_campaigns`  WHERE `web_campaigns`.`id` = 1 LIMIT 1
SELECT `form_field_entries`.* FROM `form_field_entries`  WHERE (campaign_id = 1 and model_name = 'WebFeedback')
---
  def leads_graph
        mobile_camp = WebCampaign.find_by_id(params[:camp_id])
        @camp_id = params[:camp_id]
        if !mobile_camp.blank?
           model_name = mobile_camp.model_name
           model_id = mobile_camp.model_id
           @export_data = FormFieldEntry.where("campaign_id = #{params[:camp_id]} and model_name = '#{model_name}'")

SELECT  `web_campaigns`.* FROM `web_campaigns`  WHERE `web_campaigns`.`id` = 2 LIMIT 1
---
	def graph
    return if params[:camp_id].blank?
    @camp_id = params[:camp_id]
    camp = WebCampaign.find_by_id(@camp_id)

SELECT `web_analytics`.* FROM `web_analytics`  WHERE (web_campaign_id = 2)
---
	def show
      return if params[:camp_id].blank?
      response = Array.new
      analytic = WebAnalytic.where("web_campaign_id = #{params[:camp_id]}").all

SELECT `web_campaigns`.* FROM `web_campaigns`  WHERE (is_active = 1 and user_id = 3)
SELECT `websites`.* FROM `websites`  WHERE (is_active = 1 and user_id = 3)
---
  def refresh
    @websites = current_user.websites
    @web_campaigns = WebCampaign.where(is_active: 1, user_id: current_user.id)

INSERT INTO `websites` (`created_at`, `domain`, `key`, `name`, `updated_at`, `user_id`) VALUES ('2015-01-10 07:02:12', 'www.traveltriangle.com', 'as7vzntf886jypo77qpttzczpi5d5mbge6nvtq7olgbvmza0ayz4a73m6si7h', 'traveltriangle', '2015-01-10 07:02:12', 3)
---
  def app_create
    response_data = Hash.new()
    string="#{current_user.id}"+"#{params[:campaign][:domain]}"
    bytes=Digest::SHA2.digest(string)
    key=Digest.hexencode(bytes).to_i(32).to_s(36)
    params[:campaign][:key] = key
    current_user.websites << Website.create(params[:campaign])

INSERT INTO `web_campaigns` (`created_at`, `is_active`, `model_name`, `title`, `updated_at`, `user_id`, `website_id`) VALUES ('2015-01-10 07:05:21', 0, 'WebFeedback', 'tt feedback', '2015-01-10 07:05:21', 3, '1')
UPDATE `web_campaigns` SET `model_id` = 1, `updated_at` = '2015-01-10 07:05:21' WHERE `web_campaigns`.`id` = 1
---
  def create
    response_hash = Hash.new()

    #begin
      raise "Required parameters not sent" if params[:campaign].blank?
      raise "Campaign Title can not be blank" if params[:campaign][:title].blank?
      raise "Type of Campaign must be selected" if params[:campaign][:campaign_model_name].blank?

      campaign = WebCampaign.new(params[:campaign])
      campaign.is_active = 0
      #campaign.user_id = current_user.id

      if campaign && campaign.save
        current_user.web_campaigns << campaign
        logger.error ">>>> model_name >>> #{campaign.campaign_model_name}"
        type = case campaign.campaign_model_name
        when 'WebNotification'
          save_notification_campaign_web(campaign)
        when 'WebCoupon'
          save_coupon_campaign_web(campaign)
        when 'WebFeedback'
          campaign.campaign_model_name.constantize.new(:web_campaign_id => campaign.id)
        else
          false
        end

        logger.error "type -> #{type.inspect}"
        if type && type.save