app/controllers/member/setup/web/feedback_controller.rb

SELECT  `web_feedbacks`.* FROM `web_feedbacks`  WHERE `web_feedbacks`.`id` = 1 LIMIT 1
UPDATE `web_campaigns` SET `is_active` = 1, `updated_at` = '2015-01-10 07:05:21' WHERE `web_campaigns`.`id` = 1
SELECT  `websites`.* FROM `websites`  WHERE `websites`.`id` = 1 LIMIT 1
SELECT `web_campaign_filters`.* FROM `web_campaign_filters`  WHERE (website_id in (0,1) and is_active=1)
---
  def edit
    @campaign = WebFeedback.find(params[:id])
    @web_campaign = @campaign.web_campaign
    # in case it was just deactivated, this will reactivate the campaign - Rajat
    #commented it as we want to start campaign only when user click on launch campaign btn - Aashish
    #if @campaign.is_active != 1
     # @campaign.update_attribute("is_active", 1)
    #end

    if @web_campaign.is_active != 1
      @web_campaign.update_attribute("is_active", 1)
    end
    _website = Website.find(@web_campaign.website_id)
    @web_campaign_filters = WebCampaignFilter.where("website_id in (0,#{_website.id}) and is_active=1")

SELECT  `web_feedbacks`.* FROM `web_feedbacks`  WHERE `web_feedbacks`.`id` = 1 LIMIT 1
UPDATE `web_feedbacks` SET `action_background_color` = '000', `action_text_color` = '000', `background_color` = 'f1c40f', `border_color` = 'f1c40f', `form_background_color` = 'f2efe1', `form_border_color` = 'f1c40f', `get_name` = 0, `text_color` = 'f1c40f', `title_background_color` = 'f1c40f', `title_text_color` = 'fff', `updated_at` = '2015-01-12 09:33:31' WHERE `web_feedbacks`.`id` = 2
---
  def create_or_update
    response_data = {}
    #    begin
    raise "Campaign details not sent" if params[:campaign].blank?

    # create a record
    if params[:campaign][:id].blank?
      @campaign = WebFeedback.create(params[:campaign])
    else
      @campaign = WebFeedback.find(params[:campaign][:id])
      if !@campaign.blank?
        params[:campaign].delete('id')
        params[:campaign]["is_active"] = 1
        @campaign.update_attributes(params[:campaign])